#pragma once
#pragma once
class Permutations {
public:// Цей модіфікатор приватності. Він тут не обов'язковий, він відповідає за видимість полів и методів класу в наслідниках
// Це поля класу
// Їх можна вткликати в методах класу
//Конструктор классу
    int n;// Це поле класу відповідає за кількість елементів в масиві
    // А це динамический массив нижче
    // Зірочка дозволяє виділяти місце в оперативці під масив не константою як в статичному, а змінною як ось n
    int[] arr;
    string[] ans;// pow це зведення в степінь 2 в степені n
    int iteration;
    void create_array();
    void show_all_subsets(int num = 0, string s = "");
    string[] ans1;
    void show_subsets_k(int k);
    // рекурсивна функція яка рахує факторіал
    // рекурсія - функція, яка викликає сама себе
    int Fact(int x);
    void show_all_Permutations(int l = 0);
};